## Setup technology files
include ../Source/X-FAB_SLOW.tcl
#set_attribute remove_assigns true /
## disable optimization of constant 0 signals that goes through registers 
set_attribute optimize_constant_0_flops false /
## Setup variables
set DESIGN FFTv3
set PARAMS {}
## Read in Verilog HDL files
read_hdl -v2001 ../Source/FFTv3/alpha128_input_1step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_2_step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_3_step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_4_step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_5_step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_6_step.v
read_hdl -v2001 ../Source/FFTv3/alpha128_input_7_step.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_10.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_11.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_12.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_13.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_14.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_15.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_16.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_17.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_18.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_19.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_1.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_20.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_21.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_22.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_23.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_24.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_25.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_26.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_27.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_28.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_29.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_2.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_30.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_31.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_32.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_33.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_34.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_35.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_36.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_37.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_38.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_39.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_3.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_40.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_41.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_42.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_43.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_44.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_45.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_46.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_47.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_48.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_49.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_4.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_50.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_51.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_52.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_53.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_54.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_55.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_56.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_57.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_58.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_59.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_5.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_60.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_61.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_62.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_63.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_64.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_6.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_7.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_8.v
read_hdl -v2001 ../Source/FFTv3/alpha2_input_butterfly_9.v
read_hdl -v2001 ../Source/FFTv3/Butterflies.v
read_hdl -v2001 ../Source/FFTv3/FFTv3.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_10.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_11.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_12.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_13.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_14.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_15.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_16.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_17.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_18.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_19.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_1.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_20.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_21.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_22.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_23.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_24.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_25.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_26.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_27.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_28.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_29.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_2.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_30.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_31.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_32.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_33.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_34.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_35.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_36.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_37.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_38.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_39.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_3.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_40.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_41.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_42.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_43.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_44.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_45.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_46.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_47.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_48.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_49.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_4.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_50.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_51.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_52.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_53.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_54.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_55.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_56.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_57.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_58.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_59.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_5.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_60.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_61.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_62.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_63.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_6.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_7.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_8.v
read_hdl -v2001 ../Source/FFTv3/FirthStage_9.v
read_hdl -v2001 ../Source/FFTv3/FirthStage.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_10.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_11.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_12.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_13.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_14.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_15.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_16.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_17.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_18.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_19.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_1.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_20.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_21.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_22.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_23.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_24.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_25.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_26.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_27.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_28.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_29.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_2.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_30.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_31.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_32.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_33.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_34.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_35.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_36.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_37.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_38.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_39.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_3.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_40.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_41.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_42.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_43.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_44.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_45.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_46.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_47.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_48.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_49.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_4.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_50.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_51.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_52.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_53.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_54.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_55.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_56.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_57.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_58.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_59.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_5.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_60.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_61.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_62.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_63.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_6.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_7.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_8.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB_9.v
read_hdl -v2001 ../Source/FFTv3/FourthStageB.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage10.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage11.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage12.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage13.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage14.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage15.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage16.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage17.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage18.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage19.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage1.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage20.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage21.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage22.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage23.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage24.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage25.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage26.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage27.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage28.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage29.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage2.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage30.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage31.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage32.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage33.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage34.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage35.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage36.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage37.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage38.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage39.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage3.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage40.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage41.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage42.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage43.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage44.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage45.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage46.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage47.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage48.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage49.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage4.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage50.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage51.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage52.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage53.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage54.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage55.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage56.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage57.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage58.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage59.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage5.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage60.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage61.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage62.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage63.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage6.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage7.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage8.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage9.v
read_hdl -v2001 ../Source/FFTv3/SeventhStage.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB10.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB11.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB12.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB13.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB14.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB15.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB16.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB17.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB18.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB19.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB1.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB20.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB21.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB22.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB23.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB24.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB25.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB26.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB27.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB28.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB29.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB2.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB30.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB31.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB32.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB33.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB34.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB35.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB36.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB37.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB38.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB39.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB3.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB40.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB41.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB42.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB43.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB44.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB45.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB46.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB47.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB48.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB49.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB4.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB50.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB51.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB52.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB53.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB54.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB55.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB56.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB57.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB58.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB59.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB5.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB60.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB61.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB62.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB63.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB6.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB7.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB8.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB9.v
read_hdl -v2001 ../Source/FFTv3/SixthStageB.v
read_hdl -v2001 ../Source/FFTv3/Subsystem10.v
read_hdl -v2001 ../Source/FFTv3/Subsystem11.v
read_hdl -v2001 ../Source/FFTv3/Subsystem12.v
read_hdl -v2001 ../Source/FFTv3/Subsystem13.v
read_hdl -v2001 ../Source/FFTv3/Subsystem14.v
read_hdl -v2001 ../Source/FFTv3/Subsystem15.v
read_hdl -v2001 ../Source/FFTv3/Subsystem16.v
read_hdl -v2001 ../Source/FFTv3/Subsystem17.v
read_hdl -v2001 ../Source/FFTv3/Subsystem18.v
read_hdl -v2001 ../Source/FFTv3/Subsystem19.v
read_hdl -v2001 ../Source/FFTv3/Subsystem1_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem1.v
read_hdl -v2001 ../Source/FFTv3/Subsystem20.v
read_hdl -v2001 ../Source/FFTv3/Subsystem21.v
read_hdl -v2001 ../Source/FFTv3/Subsystem22.v
read_hdl -v2001 ../Source/FFTv3/Subsystem23.v
read_hdl -v2001 ../Source/FFTv3/Subsystem24.v
read_hdl -v2001 ../Source/FFTv3/Subsystem25.v
read_hdl -v2001 ../Source/FFTv3/Subsystem26.v
read_hdl -v2001 ../Source/FFTv3/Subsystem27.v
read_hdl -v2001 ../Source/FFTv3/Subsystem28.v
read_hdl -v2001 ../Source/FFTv3/Subsystem29.v
read_hdl -v2001 ../Source/FFTv3/Subsystem2_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem2.v
read_hdl -v2001 ../Source/FFTv3/Subsystem30.v
read_hdl -v2001 ../Source/FFTv3/Subsystem31.v
read_hdl -v2001 ../Source/FFTv3/Subsystem32.v
read_hdl -v2001 ../Source/FFTv3/Subsystem33.v
read_hdl -v2001 ../Source/FFTv3/Subsystem34.v
read_hdl -v2001 ../Source/FFTv3/Subsystem35.v
read_hdl -v2001 ../Source/FFTv3/Subsystem36.v
read_hdl -v2001 ../Source/FFTv3/Subsystem37.v
read_hdl -v2001 ../Source/FFTv3/Subsystem38.v
read_hdl -v2001 ../Source/FFTv3/Subsystem39.v
read_hdl -v2001 ../Source/FFTv3/Subsystem3_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem3.v
read_hdl -v2001 ../Source/FFTv3/Subsystem40.v
read_hdl -v2001 ../Source/FFTv3/Subsystem41.v
read_hdl -v2001 ../Source/FFTv3/Subsystem42.v
read_hdl -v2001 ../Source/FFTv3/Subsystem43.v
read_hdl -v2001 ../Source/FFTv3/Subsystem44.v
read_hdl -v2001 ../Source/FFTv3/Subsystem45.v
read_hdl -v2001 ../Source/FFTv3/Subsystem46.v
read_hdl -v2001 ../Source/FFTv3/Subsystem47.v
read_hdl -v2001 ../Source/FFTv3/Subsystem48.v
read_hdl -v2001 ../Source/FFTv3/Subsystem49.v
read_hdl -v2001 ../Source/FFTv3/Subsystem4_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem4.v
read_hdl -v2001 ../Source/FFTv3/Subsystem50.v
read_hdl -v2001 ../Source/FFTv3/Subsystem51.v
read_hdl -v2001 ../Source/FFTv3/Subsystem52.v
read_hdl -v2001 ../Source/FFTv3/Subsystem53.v
read_hdl -v2001 ../Source/FFTv3/Subsystem54.v
read_hdl -v2001 ../Source/FFTv3/Subsystem55.v
read_hdl -v2001 ../Source/FFTv3/Subsystem56.v
read_hdl -v2001 ../Source/FFTv3/Subsystem57.v
read_hdl -v2001 ../Source/FFTv3/Subsystem58.v
read_hdl -v2001 ../Source/FFTv3/Subsystem59.v
read_hdl -v2001 ../Source/FFTv3/Subsystem5_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem5.v
read_hdl -v2001 ../Source/FFTv3/Subsystem60.v
read_hdl -v2001 ../Source/FFTv3/Subsystem61.v
read_hdl -v2001 ../Source/FFTv3/Subsystem62.v
read_hdl -v2001 ../Source/FFTv3/Subsystem63.v
read_hdl -v2001 ../Source/FFTv3/Subsystem6.v
read_hdl -v2001 ../Source/FFTv3/Subsystem7.v
read_hdl -v2001 ../Source/FFTv3/Subsystem8.v
read_hdl -v2001 ../Source/FFTv3/Subsystem9.v
read_hdl -v2001 ../Source/FFTv3/Subsystem_block.v
read_hdl -v2001 ../Source/FFTv3/Subsystem.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_10.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_11.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_12.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_13.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_14.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_15.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_16.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_17.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_18.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_19.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_1.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_20.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_21.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_22.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_23.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_24.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_25.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_26.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_27.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_28.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_29.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_2.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_30.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_31.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_32.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_33.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_34.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_35.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_36.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_37.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_38.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_39.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_3.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_40.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_41.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_42.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_43.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_44.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_45.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_46.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_47.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_48.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_49.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_4.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_50.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_51.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_52.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_53.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_54.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_55.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_56.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_57.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_58.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_59.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_5.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_60.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_61.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_62.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_63.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_6.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_7.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_8.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB_9.v
read_hdl -v2001 ../Source/FFTv3/ThirdStageB.v

## Compile our code (create a technology-independent schematic)
elaborate -parameters $PARAMS $DESIGN
## Setup design constraints
## read_sdc ../Source/Top/Synthesis/Top.sdc
read_sdc ../Source/SDCs/FFTRTL.sdc
## all remaining assign statements in design will be replaced with buffer BUHDX1
set_remove_assign_options -ignore_preserve_setting -buffer BUHDX1 -design FFTv3


## Synthesize our schematic (create a technology-dependent schematic)
#synthesize -to_generic
synthesize -to_mapped
synthesize -incremental

## Write out area and timing reports
report area > ../Reports/FFT_synth_area_report_fast
report timing > ../Reports/FFT_synth_timing_report_fast
## Write out synthesized Verilog netlist
write_hdl -mapped > ../Source/FFT/Synthesis/FFTv3_synth_fast.v
## Write out the SDC file we will take into the place n route tool
write_sdc > ../Source/FFT/Synthesis/FFTv3_out_fast.sdc
gui_show

